---
kind: property
id: P:Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelOptions.LeaderShoulder
source: html/e2c8a9bd-31cd-3ff8-2aa2-90adb02493cc.htm
---
# Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelOptions.LeaderShoulder Property

Specifies the leader shoulder point, in model coordinates.
 The default value is null.
 When null, the shoulder point will be the same as the Origin point,
 driven by the Station value.

## Syntax (C#)
```csharp
public XYZ LeaderShoulder { get; set; }
```